app/views/roles/_form.html.erb

      <%= field_set_tag models_names do %>
        <% Permission.where(:subject_class => models_names).each do |permission| %>
          <label class="checkbox">
            <%= check_box_tag 'role[permission_ids][]', permission.id, @role.permissions.include?(permission) %>
---
SELECT "permissions".* FROM "permissions" WHERE "permissions"."subject_class" = 'Role'
SELECT 1 AS one FROM "permissions" INNER JOIN "permissions_roles" ON "permissions"."id" = "permissions_roles"."permission_id" WHERE "permissions_roles"."role_id" = 1 AND "permissions"."id" = 1 LIMIT 1